Revit 2024 API
MEPCurveType.Shape Property
 The shape of the profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ConnectorProfileType Shape { get; }
Visual Basic
Public ReadOnly Property Shape As ConnectorProfileType
	Get
Visual C++
public:
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace